#define SIMPLE_RUMOUR_NUM	12

string DEFAULT_TEXT[30] = {
};

/// Сплетни при отсутствии актуальных слухов (простолюдинов, корчмарей, ...)
string NO_RUMOUR_TEXT[SIMPLE_RUMOUR_NUM] = {
"Последнее время ничего интересного не говорят. Жизнь течет спокойно и мирно. Просто диву даёшься!",
"У нас тут тишь да гладь. А корабли заходят нечасто, поэтому никаких сколько-нибудь важных событий за последнее время не было.",
"Приход вашего судна - вот о чём все говорят последнее время!",
"Что-то я не припомню ничего значительного. Даже драки в таверне у нас редкость.",
"Вряд ли смогу рассказать вам какие-нибудь новости, давно уже ни о чём интересном не слышал...",
"Эх, времена нынче пошли... Губернатор-то наш опять налоги поднял... вот и сосед мой с парой дружков в джунгли подались, когда их за недоимки грозились в казематы засадить\nА что людям остаётся делать? Только на вольный промысел, или к капитанам лихим наниматься - всё не тюремную баланду хлебать.",
"Говорят, солдатам в гарнизоне уже чуть не год жалование из Европы не присылают. Вот ходят слухи, что на днях оттудова, из форта, значит, несколько человек дезертировало. А куда они подадутся? Известное дело - на большую дорогу... что нам не дают, то, значит, сами и возьмем. А честному человеку уже и за ворота городские выйти боязно.",
"Губернатор наш, говорят, опять себе мебеля из Старого Света заказал, в усадьбу значит. А половина солдат в форте чуть не в обносках ходят, да горошины в похлёбке на штуки считают\nВот слыхал я, один гарнизонный офицер, продал семейные побрякушки, купил люггер и на днях ушёл в море. Его, конечно, объявили дезертиром! А что ему оставалось делать, если чины только о своём благе и пекутся?",
"Ходят слухи, что в Европе новая война зреет. Значит, опять налоги да пошлины вырастут, доброй торговле в убыток. А люд простой на большак промышлять потянется, от сборщиков да чинуш подальше\nА кто в море подастся, у Госпожи Фортуны милости искать, да от одноногой бегать... Война с нищетой да разбоем всегда об руку ходит.",
"Слыхали, из Европы новая эскадра пришла, для усиления патрулей и борьбы с каперством, значит. Да только те патрули от пиратов токмо флагом на гроте и отличаются. \nТого и гляди - в открытом море повстречают да груз и конфискуют, а уж причину надумают. Поди потом доказывай, что не твой телок овёс топтал... Вот и приходится торговцам платить конвоирам да наёмничкам за охрану своего промысла. А нам с того что? Правильно - опять цены на ром подскочут, провались оно всё пропадом!",
"Поговаривают, что в Европе снова неспокойно... Значит, опять сюда беженцы да проходимцы всех мастей потянутся. А здесь кому они нужны? Верно, тут таким одна дорога - на большак промышлять, или в море разбойничать\nЭ-хе-хе, а губернаторы опять поборы на содержание гарнизонов увеличат. Что разбойники в джунглях, что чиновники в дорогих кабинетах - простому люду всё одно - бандиты-кровопийцы...",
"Городок-то у нас тихий. Но вот недавно была форменная баталия неподалеку тут, у маяка. Один капитан, значит, с местными дельцами контрабандой промышлял, а патруль их за этим делом и застукал! \nДурные деньги счастья не приносят, попомните мои слова! Зажали, значит, патрульные бриги шхуну того кэпа у берега, и на абордаж взяли! Самого капитана-то ядром насмерть зашибло, а местных скупщиков в форте повесили. А вот матросиков жалко - всех на факторию продали. Эх-эх... спаси, Господи, их грешные души..."
};

/// Слухи нищих
string POOR_RUMOUR_TEXT[10] = {
};


